'''
	
№ 12466 (Уровень: Средний)
Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки символов.

1. заменить (v, w) 
2. нашлось (v)
Первая команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Если цепочки v в строке нет, эта команда не изменяет строку. Вторая команда проверяет, встречается ли цепочка v в строке исполнителя Редактор.
Дана программа для исполнителя Редактор:

НАЧАЛО
ПОКА нашлось(01) ИЛИ нашлось(02) ИЛИ нашлось(03)
  заменить(01, 30)
  заменить(02, 3103)
  заменить(03, 1201)
КОНЕЦ ПОКА
КОНЕЦ
Известно, что исходная строка начиналась с нуля, а далее содержала только единицы, двойки и тройки. После выполнения данной программы получилась строка, содержащая 31 единицу, 24 двойки и 46 троек. Сколько троек было в исходной строке?
'''

def avt(s):
    while '01' in s or '02' in s or '03' in s:
        s = s.replace('01', '30', 1)
        s = s.replace('02', '3103', 1)
        s = s.replace('03', '1201', 1)
    return s

for e in range(16):
    for d in range(60):
        for t in range(60):
            s = '0'+'1'*e+'2'*d+'3'*t+'0'
            # print(s)
            s2 = avt(s)
            # print(s2)
            if (s2.count('1')==31 and 
                s2.count('2')==24 and 
                s2.count('3')==46):
                print(e, d, t)
            